{
  "_class_name": "UniDiffuserTextDecoder",
  "_diffusers_version": "0.15.0.dev0",
  "_name_or_path": "/home/tamamo/scratch/unidiffuser_test/text_decoder",
  "activation_function": "gelu",
  "attn_pdrop": 0.1,
  "embd_pdrop": 0.1,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "n_embd": 32,
  "n_head": 4,
  "n_inner": 37,
  "n_layer": 5,
  "n_positions": 1024,
  "prefix_hidden_dim": 32,
  "prefix_inner_dim": 32,
  "prefix_length": 77,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "use_cache": true,
  "vocab_size": 1025
}
