{
  "_class_name": "UniDiffuserModel",
  "_diffusers_version": "0.17.0.dev0",
  "activation_fn": "gelu",
  "attention_bias": false,
  "attention_head_dim": 8,
  "block_type": "unidiffuser",
  "clip_img_dim": 32,
  "cross_attention_dim": null,
  "dropout": 0.0,
  "ff_final_dropout": true,
  "in_channels": 4,
  "norm_elementwise_affine": true,
  "norm_num_groups": 32,
  "norm_type": "layer_norm",
  "num_attention_heads": 2,
  "num_embeds_ada_norm": 1000,
  "num_layers": 2,
  "num_text_tokens": 77,
  "num_vector_embeds": null,
  "only_cross_attention": false,
  "out_channels": 4,
  "patch_size": 2,
  "pre_layer_norm": false,
  "sample_size": 16,
  "text_dim": 32,
  "upcast_attention": false,
  "use_data_type_embedding": true,
  "use_linear_projection": false,
  "use_patch_pos_embed": false,
  "use_timestep_embedding": false
}
