{
  "_class_name": "AutoencoderKL",
  "_diffusers_version": "0.15.0.dev0",
  "_name_or_path": "/home/tamamo/scratch/unidiffuser_test/vae",
  "act_fn": "silu",
  "block_out_channels": [
    32,
    64
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "in_channels": 3,
  "latent_channels": 4,
  "layers_per_block": 1,
  "norm_num_groups": 32,
  "out_channels": 3,
  "sample_size": 32,
  "scaling_factor": 0.18215,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ]
}
