{
  "architectures": [
    "CLIPVisionModelWithProjection"
  ],
  "attention_dropout": 0.1,
  "dropout": 0.1,
  "hidden_act": "quick_gelu",
  "hidden_size": 32,
  "image_size": 32,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 37,
  "layer_norm_eps": 1e-05,
  "model_type": "clip_vision_model",
  "num_attention_heads": 4,
  "num_channels": 3,
  "num_hidden_layers": 5,
  "patch_size": 2,
  "projection_dim": 32,
  "torch_dtype": "float32",
  "transformers_version": "4.26.1"
}
